tap "homebrew/bundle"
tap "homebrew/core"


#######################
# Binaries/Libraries
#######################

# app store
brew "mas"
brew "fzf"
brew "tree"
brew "git"
brew "git-flow"
brew "wget"
# non-install npm
brew "node", args: ["without-npm"]
brew "yarn"
# zsh is default in MacOS Catalina
#brew "zsh"
brew "autojump"


#######################
# App Store
#######################

mas "Xcode", id: 497799835
mas "LINE", id: 539883307
mas "KakaoTalk", id: 869223134
mas "Slack", id: 803453959


#######################
# Applications
#######################

cask "google-chrome"
cask "itsycal"
cask "iterm2"
cask "android-platform-tools"
cask "jetbrains-toolbox"

#######################
# Font
#######################

cask 'homebrew/cask-fonts/font-meslo-lg'
cask 'homebrew/cask-fonts/font-meslo-for-powerline'
