tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"


#######################
# Binaries/Libraries
#######################

# app store
brew "mas"
brew "fzf"
brew "ffmpeg"
brew "tree"
brew "git"
brew "git-flow-avh"
brew "wget"
brew "telnet"
# non-install npm
brew "node"
brew "yarn"
# zsh is default in MacOS Catalina
#brew "zsh"
brew "autojump"

#######################
# App Store
#######################

mas "LINE", id: 539883307
mas "KakaoTalk", id: 869223134
mas "Slack", id: 803453959


#######################
# Applications
#######################

cask "google-chrome"
cask "itsycal"
cask "iterm2"
cask "android-platform-tools"
cask "jetbrains-toolbox"
cask "java"

#######################
# Font
#######################

cask 'homebrew/cask-fonts/font-meslo-lg'
cask 'homebrew/cask-fonts/font-meslo-for-powerline'
